---
kind: method
id: M:Autodesk.Revit.DB.Structure.ConnectionInputPoint.#ctor(Autodesk.Revit.DB.XYZ,System.Guid)
source: html/1d7ef811-ff7d-4289-7a8f-d20d1a76eae1.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPoint.#ctor Method

Construct an input point from 3d point and id.

## Syntax (C#)
```csharp
public ConnectionInputPoint(
	XYZ pt,
	Guid uid
)
```

## Parameters
- **pt** (`Autodesk.Revit.DB.XYZ`)
- **uid** (`System.Guid`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null